Revit 2024 API
ParameterTypeId.DivisionSketchCurveExtentdToSilhParam Property
 "Extend to Silhouette"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DivisionSketchCurveExtentdToSilhParam { get; }
Visual Basic
Public Shared ReadOnly Property DivisionSketchCurveExtentdToSilhParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DivisionSketchCurveExtentdToSilhParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace